package com.jk.measure.utils;

public class MeasureUtil {

    public static String SANHE_SANHUI = "{'木':[['寅','卯','辰'],['亥','卯','未']],'金':[['申','酉','戌'],['巳','酉','丑']],'火':[['巳','午','未'],['寅','午','戌']],'水':[['亥','子','丑'],['申','子','辰']],'土':[['辰','戌','丑','未']]}";

    public static String TIAN_GAN_WU_X = "{'木':['甲','乙'],'金':['庚','辛'],'火':['丙','丁'],'水':['壬','癸'],'土':['戊','己']}";

    public static String DI_ZHI_WU_X = "{'木':['寅','卯'],'金':['申','酉'],'火':['巳','午'],'水':['子','亥'],'土':['辰','戌','丑','未']}";

    public static String WU_X_SHENG_KE = "{'s':['金','水','木','火','土'],'k':['水','火','金','木','土']}";

    public static String[] DI_CHONG = {"己亥", "寅申", "子午", "卯酉", "辰戌", "丑未"};

}
